import os
from discordbot import bot_token_ds
import discord
from discord.ext import commands
import random
import asyncio
import requests

token = bot_token_ds
client = discord.Client()
bot = commands.Bot(command_prefix='!')

# дает пользователю список всех персонажей для инфы про них
heroes_list = {
    "1": "Ёимия",
    "2": "Альбедо",
    "3": "Аяка",
    "4": "Аято",
    "5": "Барбара",
    "6": "Беннет",
    "7": "Бэй Доу",
    "8": "Венти",
    "9": "Гань Юй",
    "10": "Горо",
    "11": "Джинн",
    "12": "Дилюк",
    "13": "Диона",
    "14": "Итто",
    "15": "Кадзуха",
    "16": "Кли",
    "17": "Кокоми",
    "18": "Кэ Цин",
    "19": "Кэйа",
    "20": "Лиза",
    "21": "Мона",
    "22": "Нин Гуан",
    "23": "Ноэлль",
    "24": "Розария",
    "25": "Рэйзор",
    "26": "Сёгун Райдэн",
    "27": "Сара",
    "28": "Сахароза",
    "29": "Саю",
    "30": "Син Цю",
    "31": "Синь Янь",
    "32": "Сян Лин",
    "33": "Сяо",
    "34": "Тарталья",
    "35": "Тома",
    "36": "Фишль",
    "37": "Ху Тао",
    "38": "Ци Ци",
    "39": "Чжун Ли",
    "40": "Чун Юнь",
    "41": "Шень Хэ",
    "42": "Элой",
    "43": "Эмбер",
    "44": "Эола",
    "45": "Юнь Цзинь",
    "46": "Янь Фэй",
    "47": "Яэ Мико",
}


@bot.command(name="start")
async def heroes(ctx):
    await ctx.send(
        "1 - Ёимия\n2 - Альбедо\n3 - Аяка\n4 - Аято\n5 - Барбара\n6 - Беннет\n7 - Бэй Доу\n8 - Венти\n9 - Гань Юй\n10 - Горо\n11 - Джинн\n12 - Дилюк\n13 - Диона\n14 - Итто\n15 - Кадзуха\n16 - Кли\n17 - Кокоми\n18 - Кэ Цин\n19 - Кэйа\n20 - Лиза\n21 - Мона\n22 - Нин Гуан\n23 - Ноэлль\n24 - Розария\n25 - Рэйзор\n26 - Сёгун Райдэн\n27 - Сара\n28 - Сахароза\n29 - Саю\n30 - Син Цю\n31 - Синь Янь\n32 - Сян Лин\n33 - Сяо\n34 - Тарталья\n35 - Тома\n36 - Фишль\n37 - Ху Тао\n38 - Ци Ци\n39 - Чжун Ли\n40 - Чун Юнь\n41 - Шень Хэ\n42 - Элой\n43 - Эмбер\n44 - Эола\n45 - Юнь Цзинь\n46 - Янь Фэй\n47 - Яэ Мико\n"
    )


# если пользователь напишит после !get цифру то ему выдадут инфу про них

@bot.command(name='get')
async def get(ctx, *args):
    pers_name = args[0]
    b = os.listdir(f"heroes/{heroes_list[pers_name]}")
    files = b  # Set the 5 files (or more ?) you want to upload here
    await asyncio.wait([ctx.send(file=discord.File(f"heroes/{heroes_list[pers_name]}/{i}")) for i in files])
    # проходит циклом по всей папки с фото тем самым отправляет их все


@bot.command(name='g')
async def g(ctx):
    await ctx.send(requests.get('https://api.waifu.pics/sfw/waifu').json()['url'])


# ну а это просто подарок для пользователь


bot.run(token)
